CSI API ETABS v1
cAreaObj.GetSpandrel Method
 Retrieves the Spandrel label assignments of an area object
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSpandrel(
	string Name,
	ref string SpandrelName
)
Function GetSpandrel (
	Name As String,
	ByRef SpandrelName As String
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim SpandrelName As String
Dim returnValue As Integer
returnValue = instance.GetSpandrel(Name,
	SpandrelName)
int GetSpandrel(
	String^ Name,
	String^% SpandrelName
)
abstract GetSpandrel :
        Name : string *
        SpandrelName : string byref -> int
Parameters
Name
Type: System.String
 The name of an existing area object
SpandrelName
Type: System.String
 The name of the Spandrel assignment, if any, or "None"
Return Value
Type: Int32
 Returns zero if the assignment is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim SpandrelName as String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'define new Spandrel label
    ret = SapModel.SpandrelLabel.SetSpandrel("MySpandrel")
'set assignment
    ret = SapModel.AreaObj.SetSpandrel("3", "MySpandrel")
'get assignment
    ret = SapModel.AreaObj.GetSpandrel("3", SpandrelName)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace